# UART SA828 programming via RP2040

Based on [SA828 1.5W full featured miniature walkie talkie module V2.5.pdf](https://www.nicerf.com/walkie-talkie-module/walkie-talkie-module-sa828.html)

Implemented in [sa828.py](../src/sa828.py)

## Communication protocol

### Commands Format:

After module running, the standard setting of serial port as below:

Baud Rate: 9600 bps Date Bit: 8 Stop: 1 Parity: None

#### Instruction return format:

Return true: OK\r\n, Return false: ERROR\r\n

#### Frame format Definition:

ASCII is used in communication protocol.
Note: CDCSS can be checked in Appendix1

### Read Module Name and Version Number

Format: AA FA A

Return Value: SAxxx_VERx.x\r\n

Example: AAFAA (Hex: 0x41 0x41 0x46 0x41 0x41)

Return: SA828-1W_VER1.0\r\n (Hex: 0x53 0x41 0x36 0x31 0x30 0x5f 0x56 0x45 0x52 0x31 0x2E 0x30 0x0D 0x0A)

### Read parameter

Format: AA FA 1

Return: AA FA TFV1, RFV2, ....., TFV16, RFV16, TX_SUBAUDIO, RX_SUBAUDIO, SQ

Parameters description in the Setup Group Instructions

Example: AAFA1 (Hex 0x41 0x41 0x46 0x41 0x31 )

Return: AA450.1250,450.1250,451.1250,451.1250,452.1250,452.1250,453.1250,453.1250,454.1250,454.1250,455.1250,455.1250,456.1250,456.1250,457.1250,457.1250,458.1250,458.1250,459.1250,459.1250,455.0250,455.0250,455.1250,455.1250,455.2250,455.2250,455.3250,455.3250,455.4250,455.4250,455. 5250,455.5250,011,125,8 

(Hex 41 41 34 35 30 2e 31 32 35 30 2c 34 35 30 2e 31 32 35 30 2c 34 35 31 2e 31 32 35 30 2c 34 35 31 2e 31 32 35 30 2c 34 35 32 2e 31 32 35 30 2c 34 35 32 2e 31 32 35 30 2c 34 35 33 2e 31 32 35 30 2c 34 35 33 2e 31 32 35 30 2c 34 35 34 2e 31 32 35 30 2c 34 35 34 2e 31 32 35 30 2c 34 35 35 2e 31 32 35 30 2c 34 35 35 2e 31 32 35 30 2c 34 35 36 2e 31 32 35 30 2c 34 35 36 2e 31 32 35 30 2c 34 35 37 2e 31 32 35 30 2c 34 35 37 2e 31 32 35 30 2c 34 35 38 2e 31 32 35 30 2c 34 35 38 2e 31 32 35 30 2c 34 35 39 2e 31 32 35 30 2c 34 35 39 2e 31 32 35 30 2c 34 35 35 2e 30 32 35 30 2c 34 35 35 2e 30 32 35 30 2c 34 35 35 2e 31 32 35 30 2c 34 35 35 2e 31 32 35 30 2c 34 35 35 2e 32 32 35 30 2c 34 35 35 2e 32 32 35 30 2c 34 35 35 2e 33 32 35 30 2c 34 35 35 2e 33 32 35 30 2c 34 35 35 2e 34 32 35 30 2c 34 35 35 2e 34 32 35 30 2c 34 35 35 2e 35 32 35 30 2c 34 35 35 2e 35 32 35 30 2c s30 31 31 2c 31 32 35 2c 38 0d 0a)

### Set to default parameter

Format: AA FA 2

Return Value: "OK\r\n"OR "ERROR\r\n" 

Example: AAFA2 (Hex 41 41 46 41 32 )

Return: OK\r\n (Hex 4f 4b 0d 0a)

### Setup group instructions:

Description: this command is used to tell module the information of setting parameters

Format: AA FA 3 TFV1, RFV2, ....., TFV16, RFV16, TX_SUBAUDIO, RX_SUBAUDIO, SQ

Parameter Description: 

- TX_SUBAUDIO: TX CTCSS/CDCSS
- RX_SUBAUDIO: RX CTCSS/CDCSS
- SQ: Squelch level (0ï½ž8) (0: monitor mode,0 can not be used in scan mode)

(Note: TX and RX can use different CTCSS value, 000: no coding 001-038: CTCSS, 039--204: CDCSS, CDCSS displays code on the configuration software, the data and code as shown on Appendix 1)

Example: AAFA3450.1250,450.1250,451.1250,451.1250,452.1250,452.1250,453.1250,453.1250,454.1250,454.1250,455.1250,455.1250,456.1250,456.1250,457.1250,457.1250,458.1250,458.1250,459.1250,459.1250,455.0250,455.0250,455.1250,455.1250,455.2250,455.2250,455.3250,455.3250,455.4250,455.4250,455. 5250,455.5250,011,125,8

(Hex 41 41 46 41 33 34 35 30 2e 31 32 35 30 2c 34 35 30 2e 31 32 35 30 2c 34 35 31 2e 31 32 35 30 2c 34 35 31 2e 31 32 35 30 2c 34 35 32 2e 31 32 35 30 2c 34 35 32 2e 31 32 35 30 2c 34 35 33 2e31 32 35 30 2c 34 35 33 2e 31 32 35 30 2c 34 35 34 2e 31 32 35 30 2c 34 35 34 2e 31 32 35 30 2c 34 35 35 2e 31 32 35 30 2c 34 35 35 2e 31 32 35 30 2c 34 35 36 2e 31 32 35 30 2c 34 35 36 2e 31 32 35 30 2c 34 35 37 2e 31 32 35 30 2c 34 35 37 2e 31 32 35 30 2c 34 35 38 2e 31 32 35 30 2c 34 35 38 2e31 32 35 30 2c 34 35 39 2e 31 32 35 30 2c 34 35 39 2e 31 32 35 30 2c 34 35 35 2e 30 32 35 30 2c 34 35 35 2e 30 32 35 30 2c 34 35 35 2e 31 32 35 30 2c 34 35 35 2e 31 32 35 30 2c 34 35 35 2e 32 32 35 30 2c 34 35 35 2e 32 32 35 30 2c 34 35 35 2e 33 32 35 30 2c 34 35 35 2e 33 32 35 30 2c 34 35 35 2e 34 32 35 30 2c 34 35 35 2e 34 32 35 30 2c 34 35 35 2e 35 32 35 30 2c 34 35 35 2e 35 32 35 30 2c 30 31 31 2c 31 32 35 2c 38 0d 0a)

Return instruction: "OK\r\n" or "ERROR\r\n" OK\r\n (Hex 4f 4b 0d 0a)